/*
*********************************************************************************************************
*											  Message Handling
*
*                                         (c) Copyright 2021/10/02
*
* @File    : msghand.c
* @Author  : yqxu
*
* @Description:
* ----------
*  处理客户端和[--服务器--]进行套接字通信时的    接收函数
*  处理客户端与[ -显示屏- ]进行消息队列通信时的  发送函数
*
* @History
*  Version :    Time    :  Author :  	Description
*   v1.0   : 2021-10-02 :   yqxu  :   消息处理函数
* 
*********************************************************************************************************
*/

#include "../../include/client/msgops.h"

/*
****************************************************************************************
*                               消息队列发送函数
*
* @Desc  : 判断发给显示屏的函数是否成功
* @buf	 : 需要发送的文本
* @Note  : 失败就会杀死显示屏进程,关闭消息队列
* @Note	 : 结构体send_msg一定不能有空指针成员
* @return: 无返回值
****************************************************************************************
*/
void myMsgSend(Msg send_msg)
{
	if(msgsnd(msg_id,(void *)&send_msg,sizeof(send_msg),0)==-1){
		perror("[ \033[31mError\033[0m ] client/menu.c : msgsnd");
		killDisplay(msg_key_text);
		msgctl(msg_id,IPC_RMID,0); 
		exit(EXIT_FAILURE); 
	}
	return;
}

/*
****************************************************************************************
*                               	套接字接收函数
*!!!暂时废弃,因为设计该函数在特定情况下会运行出bug,只有改成线程函数才能解决问
* 	题,但是这样的话,对于原来的写法没有升级,所以暂时不需要
* @Desc  : 客户端登入成功后,所有接收到的消息都要经过这个函数处理后使用
* 			可能会接收到各类消息,但是调用的失火
* @buf	 : 需要发送的文本
* @Note  : 失败就会杀死显示屏进程,关闭消息队列
* @Note	 : 结构体send_msg一定不能有空指针成员
* @return: 无返回值
****************************************************************************************
*/
void mySockRecv(Msg *recv_msg)
{
	//printf("");
	
	/*
	while(1){
			recv_msg
			
			if()
				
			else {
				return]
			}
	}*/
	return;
}